#### IDockablePaneProvider Members

---

|  |
| --- |
| IDockablePaneProvider Interface   Methods   See Also |

The  IDockablePaneProvider  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | SetupDockablePane | Method called during initialization of the user interface to gather information about a dockable pane window. |

# See Also

IDockablePaneProvider Interface

Autodesk.Revit.UI Namespace